Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/interview.html.txt.tmx
Source language: en
Languages: ga

source: The Gardaí (Irish police force) are entitled to interview you if you have been arrested, charged and cautioned in Ireland
ga: Tá sé de chead ag na Gardaí agallamh a chur ar dhuine má tá sé/sí gafa, cúisithe agus rabhadh tugtha dó/dí

source: There are different rules that apply to the interviews of people over 18 years and people under 18 years
ga: Tá rialacha difriúla a bhaineann le hagallamh a chur ar dhaoine atá os cionn 18 agus daoine atá níos óige ná 18 bliain d'aois

source: If you are 18 years old or over
ga: Duine atá 18 bliain d'aois nó níos sine

source: You have a right to consult a solicitor before you are interviewed
ga: Tá sé de cheart dul i gcomhairle le haturnae sular tá tú agallamh

source: If you ask for a solicitor you cannot be questioned until they arrive, except in exceptional circumstances
ga: Má iarrann tú le haghaidh aturnae nach féidir leat a cheistiú go dtí go sroicheann siad

source: Before you are interviewed, the Garda conducting the interview will identify himself or herself and any other Garda in the room, by name and rank
ga: Roimh an t-agallamh, ba cheart don Gharda atá i mbun an agallaimh é/í féin a chur in aithne chomh maith le haon Gharda eile atá i láthair sa seomra, ag tabhairt a gcuid ainmneacha agus a gcéim

source: The interview must be conducted in a fair and humane manner
ga: Ní mór don agallamh a bheith cothrom agus daonnachtúil

source: No more than two Gardai can question you at any one time and no more than four Gardai can be in the room at any one time during the interview
ga: Ní féidir le níos mó ná 2 Gharda duine a cheistiú ag an am agus ní féidir le níos mó ná 4 Gharda a bheith sa seomra nuair atá an t-agallamh dhá dhéanamh

source: If an interview has lasted for four hours, it must either be ended or adjourned for a reasonable time
ga: Má mhaireann agallamh ar feadh 4 uaire an chloig ní mór deireadh a chur leis nó sos ar feadh tréimhse ama réasúnta a thógáil

source: As far as possible, interviews will take place in rooms set aside for interviews only
ga: Chomh fada agus is féidir ba cheart don agallamh a bheith i seomra atá curtha ar leataobh ar son agallamh amháin

source: Except with the permission of the Garda in charge of the station, you may not be questioned between midnight and 8 a.m
ga: Ach amháin le cead ón nGarda atá i gceannas an stáisiúin, ní féidir duine a cheistiú idir meánoíche agus 8 r.n

source: Permission can only be given in exceptional circumstances or if you were brought to the station during that time
ga: Ní féidir an cead sin a thabhairt ach amháin i gcúinsí eisceachtúla amháin nó má tugadh duine isteach sa stáisiún idir na huaireanta sin

source: If you are deaf or there is doubt about your hearing ability, you cannot be questioned without an interpreter, if one is reasonably available, unless you give your written consent
ga: Más duine bodhar atá i gceist nó má tá amhras faoi éisteacht an duine ní féidir é/í a cheistiú gan teangaire, más féidir teacht ar dhuine, gan cead a fháil i scríbhinn ón té atá le ceistiú

source: If you have requested an interpreter and one is not reasonably available, any questions will be put to you in writing
ga: Má tá éileamh déanta ag an duine go mbeadh teangaire i láthair agus muna bhfuil fáil ar theangaire, is i scríbhinn a chuirfear aon cheisteanna air/uirthi

source: If you are drunk or under the influence of drugs so that you are unable to appreciate the significance of questions put to you or your answers, you cannot be questioned while you are in that condition except with the permission of the member in charge of the station
ga: Má tá duine ar meisce nó faoi thionchar drugaí agus dá bharr muna bhfuil sé/sí in ann tábhacht na gceisteanna ná na bhfreagraí a thuiscint, ní féidir an duine a cheistiú agus é/í faoin tionchar sin, ach amháin le cead an Gharda atá i gceannas an stáisiúin

source: Permission can only be given in exceptional circumstances
ga: Ní féidir an cead sin a thabhairt ach amháin i gcúinsí eisceachtúla

source: If, while you are being interviewed, you make a complaint to a Garda in relation to your treatment while in custody, the Garda must notify the member in charge of the station, if he or she is not present at the interview, and record it
ga: Má dhéanann an té atá dhá cheistiú gearrán le Garda faoin gcaoi a caitheamh leis/léi agus é/í faoi choimeád ní mór don Gharda é sin a chur in iúl don Gharda atá i gceannas an stáisiúin, muna bhfuil sé/sí i láthair ag an agallamh agus taifead den gearrán a dhéanamh

source: A record must be kept of your interview either by the Garda conducting it or by another Garda who is present
ga: Ní mór don Gharda atá i mbun an agallaimh nó Garda eile atá i láthair taifead a choinneáil den agallamh a chuirtear ar dhuine

source: The record must include details of the time the interview began and ended, any breaks in it, the place of the interview and the names and ranks of the Gardai present
ga: Ní mór go mbeadh sonraí den am ar thosaigh an t-agallamh agus ar cuireadh deireadh leis, aon bhriseadh a tógadh, cén áit ina raibh an t-agallamh déanta agus ainmneacha agus céimeanna na nGardaí a bhí i láthair mar chuid den taifead

source: If the interview is not electronically recorded, the record will be kept in the Garda's notebook
ga: Muna raibh taifead leictreonach den agallamh déanta, déanfar taifead i leabhar nótaí an Gharda

source: If you are under 18 years old
ga: Duine atá faoi 18 bliain d'aois

source: If you are under 18 years of age, you cannot be questioned unless a parent or guardian is present
ga: Má tá an duine faoi 18 bliain d'aois ní féidir é/í a cheistiú muna bhfuil tuismitheoir nó coimirceoir i láthair

source: If it is not possible to get the parent or guardian you requested to come to the interview, the member in charge of the station must try to arrange for your other parent, another guardian, an adult relative or some other responsible person other than a Garda to attend
ga: Muna féidir leis an tuismitheoir nó leis an gcoimirceoir a d'iarr an páiste teacht chuig an agallamh, ní mór don Gharda atá i gceannas an stáisiúin iarracht a dhéanamh an tuismitheoir eile, coimirceoir eile, gaol fásta nó duine eile freagrach nach Garda é/í a bheith i láthair

source: The member in charge of the station may give permission to question you without a parent or guardian present in exceptional circumstances or if it has not been possible to communicate with a parent or guardian or to get them to attend within a reasonable time
ga: Is féidir leis an nGarda atá i gceannas an stáisiúin cead a thabhairt duine óg a cheistiú gan tuismitheoir nó coimirceoir a bheith i láthair i gcásanna eisceachtúla nó má theip ar iarrachtaí taobh istigh de thréimhse réasúnta dul i dteagmháil le tuismitheoir nó le coimirceoir agus iarraidh orthu teacht i láthair

source: The member in charge may exclude your parent or guardian from the interview if:
ga: Is féidir leis an nGarda i gceannais an tuismitheoir nó coimirceoir a choinneáil amach ón agallamh:

source: • your parent or guardian is the victim of the offence being investigated
ga: • más do thuismitheoir nó do chaomhnóir íospartach an chiona atá á imscrúdú

source: • your parent or guardian has been arrested in relation to the offence or is a suspect,
ga: • gabhadh do thuismitheoir nó caomhnóir maidir leis an gcion nó más duine é/í atá faoi amhras,

source: • the member in charge has reasonable grounds for believing that your parent or guardian would obstruct the course of justice if he or she was at the interview
ga: • tá forais réasúnta ag an mball i gceannas lena chreidiúint go gcuirfeadh do thuismitheoir nó do chaomhnóir bac le cúrsa na córa dá mbeadh sé nó sí ag an agallamh
